Autodesk.Revit.DB.FilterIntegerRule.#ctor(Autodesk.Revit.DB.FilterableValueProvider,Autodesk.Revit.DB.FilterNumericRuleEvaluator,System.Int32)
Constructs an instance of FilterIntegerRule.
valueProvider:
A pointer to a "value provider" object that will extract values from a Revit document.
evaluator:
A pointer to the filter rule evaluator object that implements the desired test.
The built-in evaluators implement commonly used tests such as less-than, greater-than
less-than-or-equal-to, equal, etc.
ruleValue:
The user-supplied value against which values from a Revit document will be tested.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011